OpenFOAM/montana-v2106/run/mhdFoam/shockTube/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    left
    {
     //   type            cyclic;
	//type            zeroGradient;
	type            noSlip;
    }
    right
    {
      //  type            cyclic;
	//type            zeroGradient;
	type            noSlip;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
