OpenFOAM/montana-v2106/run/mhdFoam/shockTube/0_orig/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];


internalField   uniform (0 0 0); 


boundaryField
{
    left
    {
       // type            cyclic;
	type            zeroGradient;
    }
    right
    {
      //  type            cyclic;
	type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
